Mudanças:
*Na relação filmes, adicionamos a coluna title, runtime, popularity, status, revenue, release_date

In [1]:
import pandas as pd

# Relação filmes

In [26]:
movies_metadata = pd.read_csv('moviesdt/movies_metadata.csv')
credits = pd.read_csv('moviesdt/credits.csv')
ratings = pd.read_csv('moviesdt/ratings.csv')
keywords = pd.read_csv('moviesdt/keywords.csv')

/tmp/ipykernel_5786/211588150.py:1: DtypeWarning: Columns (10) have mixed types. Specify dtype option on import or set low_memory=False.
  movies_metadata = pd.read_csv('moviesdt/movies_metadata.csv')

In [3]:
filmes = movies_metadata

### Na relação filmes, mudar os atributos para os listados abaixo

In [4]:
colunas_filmes = ['id', 'homepage', 'adult', 'budget', 'original_language', 'original_title', 'title', 'overview','runtime', 'popularity', 'status', 'revenue', 'release_date' ,'id_coletanea'] #colunas que teremos no novo dataset e não precisam ser tratadas

In [5]:
list(set(filmes.columns) - set(colunas_filmes))

['imdb_id',
 'production_companies',
 'spoken_languages',
 'genres',
 'tagline',
 'vote_count',
 'belongs_to_collection',
 'video',
 'vote_average',
 'production_countries',
 'poster_path']

In [6]:
for coluna in list(set(filmes.columns) - set(colunas_filmes)):
        filmes = filmes.drop(coluna, axis = 1)

In [7]:
filmes['id_coletanea'] = movies_metadata['belongs_to_collection']

In [8]:
filmes = filmes.reindex(columns=['id', 'title', 'homepage', 'adult', 'budget', 'original_language', 'original_title', 'overview', 'id_coletanea'])

### Tabela coletânea

In [9]:
#coletaneasDf
idsColet = []
nomesColet = []
for linha in filmes['id_coletanea']:
    if not isinstance(linha, str):
        continue
    x = eval(linha)
    if not isinstance(x, dict):
        continue
    id = x.get('id')
    if id not in idsColet:
        idsColet.append(id)
        nomesColet.append(x.get('name'))
            
coletaneas = {'id': idsColet, 'nome': nomesColet}
coletaneasDf = pd.DataFrame.from_dict(coletaneas)

In [10]:
coletaneasDf

          id                            nome
0      10194            Toy Story Collection
1     119050       Grumpy Old Men Collection
2      96871  Father of the Bride Collection
3        645           James Bond Collection
4     117693                Balto Collection
...      ...                             ...
1690  104774  Tomtar och Trolltyg Collection
1691  400500       Чебурашка и крокодил Гена
1692  148603               Ducobu Collection
1693  152918          Mister Blot Collection
1694  200641            Red Lotus Collection

[1695 rows x 2 columns]

### Tabela ator

In [11]:
#atoresDf
idAtores = []
nomesAtores = []
generosAtores = []

nomesVistos = set()

i = 0
for indice, linha in credits.iterrows():
    elenco = eval(linha['cast'])
    for papel in elenco:
        if papel['name'] not in nomesVistos:
            nomesVistos.add(papel['name'])
            idAtores.append(i)
            i += 1
            nomesAtores.append(papel['name'])
            generosAtores.append(papel['gender'])

atores = {'id': idAtores, 'nome': nomesAtores, 'genero': generosAtores}
atoresDf = pd.DataFrame.from_dict(atores)

In [12]:
atoresDf

            id               nome  genero
0            0          Tom Hanks       2
1            1          Tim Allen       2
2            2        Don Rickles       2
3            3         Jim Varney       2
4            4      Wallace Shawn       2
...        ...                ...     ...
202742  202742    Jeremy Lelliott       2
202743  202743      Jason Widener       0
202744  202744     Kiko Ellsworth       2
202745  202745   Darrell Dubovsky       0
202746  202746  Aleksandr Chabrov       0

[202747 rows x 3 columns]

### Tabela Atuação

In [13]:
#atuacoesDf
id_filmeAtuacoes = []
id_atorAtuacoes = []
nomesPersonagens = []

nomeParaIdAtor = {}

for indice, linha in atoresDf.iterrows():
    nomeParaIdAtor[linha['nome']] = linha['id']

for indice, linha in credits.iterrows():
    elenco = eval(linha['cast'])
    for papel in elenco:
        if papel['name'] not in nomeParaIdAtor or papel['character'] == '':
            continue
        idAtor = nomeParaIdAtor[papel['name']]
        id_atorAtuacoes.append(idAtor)
        id_filmeAtuacoes.append(linha['id'])
        nomesPersonagens.append(papel['character'])

atuacoes = {'id_movie': id_filmeAtuacoes, 'id_ator': id_atorAtuacoes, 'personagem': nomesPersonagens}
atuacoesDf = pd.DataFrame.from_dict(atuacoes)

In [14]:
atuacoesDf

        id_movie  id_ator               personagem
0            862        0            Woody (voice)
1            862        1   Buzz Lightyear (voice)
2            862        2  Mr. Potato Head (voice)
3            862        3       Slinky Dog (voice)
4            862        4              Rex (voice)
...          ...      ...                      ...
536687     67758   192506            Sammy Benetto
536688     67758   202744                    Steve
536689     67758    54486                     Fred
536690     67758     4749         Artie, Hitman #1
536691     67758   202745                  Doorman

[536692 rows x 3 columns]

### Tabela Produtor

In [15]:
#produtoresDf
idProdutores = []
nomesProdutores = []
generosProdutores = []
deptosProdutores = []
jobsProdutores = []

nomesVistos = set()

i = 0
for indice, linha in credits.iterrows():
    elenco = eval(linha['crew'])
    for membro in elenco:
        if not membro['name'] or not membro['department'] or not membro['job']:
            continue
        if membro['name'] not in nomesVistos:
            nomesVistos.add(membro['name'])
            idProdutores.append(i)
            i += 1
            nomesProdutores.append(membro['name'])
            generosProdutores.append(membro['gender'])
            deptosProdutores.append(membro['department'])
            jobsProdutores.append(membro['job'])

produtores = {'id': idProdutores, 'nome': nomesProdutores, 
            'genero': generosProdutores, 'departamento': deptosProdutores,
             'job': jobsProdutores}
produtoresDf = pd.DataFrame.from_dict(produtores)

In [16]:
produtoresDf

,id,nome,genero,departamento,job
0,0,John Lasseter,2,Directing,Director
1,1,Joss Whedon,2,Writing,Screenplay
2,2,Andrew Stanton,2,Writing,Screenplay
3,3,Joel Cohen,2,Writing,Screenplay
4,4,Alec Sokolow,0,Writing,Screenplay
...,...,...,...,...,...
157609,157609,Sahand Torabi,0,Costume & Make-Up,Makeup Designer
157610,157610,Homayoun Shajarian,0,Sound,Songs
157611,157611,Dante Perez,0,Art,Production Design
157612,157612,Jeffrey Goldenberg,2,Writing,Screenplay
157613,157613,Daisy Asquith,0,Directing,Director

### Tabela Producao

In [17]:
#producoesDf
id_produtores = []
id_filmes = []

nomeParaIdProd = {}


for indice, linha in produtoresDf.iterrows():
    nomeParaIdProd[linha['nome']] = linha['id']

i = 0
for indice, linha in credits.iterrows():
    elenco = eval(linha['crew'])
    for membro in elenco:
        id_produtores.append(nomeParaIdProd[membro['name']])
        id_filmes.append(linha['id'])
        
producoes = {'id_produtor': id_produtores, 'id_movie': id_filmes}
producoesDf = pd.DataFrame.from_dict(producoes)

In [18]:
producoesDf

        id_produtor  id_movie
0                 0       862
1                 1       862
2                 2       862
3                 3       862
4                 4       862
...             ...       ...
464309       112881     67758
464310        17224     67758
464311        61852    227506
464312        61854    227506
464313       157613    461257

[464314 rows x 2 columns]

### Tabela Avaliacao

In [31]:
#avaliacoesDf
movie_ids = []
notas = []
timestamps = []

for indice, linha in ratings.iterrows():
    movie_ids.append(int(linha['movieId']))
    notas.append(linha['rating'])
    timestamps.append(int(linha['timestamp']))

avaliacoes = {'id_movie': movie_ids, 'rating': notas, 'timestamp': timestamps}
avaliacoesDf = pd.DataFrame.from_dict(avaliacoes)

In [32]:
avaliacoesDf

          id_movie  rating   timestamp
0              110     1.0  1425941529
1              147     4.5  1425942435
2              858     5.0  1425941523
3             1221     5.0  1425941546
4             1246     5.0  1425941556
...            ...     ...         ...
26024284     58559     5.0  1257031564
26024285     60069     5.0  1257032032
26024286     63082     4.5  1257031764
26024287     64957     4.5  1257033990
26024288     71878     2.0  1257031858

[26024289 rows x 3 columns]

### Tabela KeyWords

In [48]:
id_filmes = []
palavras = []

for indice, linha in keywords.iterrows():
    objeto = eval(linha['keywords'])
    for palavra in objeto:
        id_filmes.append(linha['id'])
        palavras.append(palavra['name'])

keywords = {'id_movie': id_filmes, 'keyword': palavras}
keywordsDf = pd.DataFrame.from_dict(keywords)

In [49]:
keywordsDf

        id_movie       keyword
0            862      jealousy
1            862           toy
2            862           boy
3            862    friendship
4            862       friends
...          ...           ...
158675    289923  mockumentary
158676    439050   tragic love
158677    111109        artist
158678    111109          play
158679    111109         pinoy

[158680 rows x 2 columns]

### Tabela Genero

In [75]:
#generosDf
genVistos = set()

nomesGeneros = []
idGeneros = []

for indice, linha in movies_metadata.iterrows():
    gens = eval(linha['genres'])
    for genero in gens:
        if genero['name'] in genVistos:
            continue
        genVistos.add(genero['name'])
        nomesGeneros.append(genero['name'])
        idGeneros.append(genero['id'])

generos = {'id': idGeneros, 'nome': nomesGeneros}
generosDf = pd.DataFrame.from_dict(generos)

In [76]:
generosDf

       id                                   nome
0      16                              Animation
1      35                                 Comedy
2   10751                                 Family
3      12                              Adventure
4      14                                Fantasy
5   10749                                Romance
6      18                                  Drama
7      28                                 Action
8      80                                  Crime
9      53                               Thriller
10     27                                 Horror
11     36                                History
12    878                        Science Fiction
13   9648                                Mystery
14  10752                                    War
15  10769                                Foreign
16  10402                                  Music
17     99                            Documentary
18     37                                Western
19  10770                               TV Movie
20  11176                   Carousel Productions
21  11602              Vision View Entertainment
22  29812       Telescene Film Group Productions
23   2883                                Aniplex
24   7759                                GoHands
25   7760                              BROSTA TV
26   7761  Mardock Scramble Production Committee
27  33751                       Sentai Filmworks
28  17161                          Odyssey Media
29  18012                     Pulser Productions
30  18013                            Rogue State
31  23822                             The Cartel

### Tabela genero_filme

In [77]:
id_filmes = []
id_generos = []

for indice, linha in movies_metadata.iterrows():
    gens = eval(linha['genres'])
    for genero in gens:
        id_filmes.append(linha['id'])
        id_generos.append(genero['id'])

generoFilme = {'id_movie': id_filmes, 'id_genero': id_generos}
generoFilmeDf = pd.DataFrame.from_dict(generoFilme)

In [78]:
generoFilmeDf

      id_movie  id_genero
0          862         16
1          862         35
2          862      10751
3         8844         12
4         8844         14
...        ...        ...
91101   439050      10751
91102   111109         18
91103    67758         28
91104    67758         18
91105    67758         53

[91106 rows x 2 columns]

### Testes

In [89]:
for col in filmes:
    print(col)

id
title
homepage
adult
budget
original_language
original_title
overview
id_coletanea

In [88]:
filmes

,id,title,homepage,adult,budget,original_language,original_title,overview,id_coletanea
0,862,Toy Story,http://toystory.disney.com/toy-story,False,30000000,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...","{'id': 10194, 'name': 'Toy Story Collection', ..."
1,8844,Jumanji,NaN,False,65000000,en,Jumanji,When siblings Judy and Peter discover an encha...,NaN
2,15602,Grumpier Old Men,NaN,False,0,en,Grumpier Old Men,A family wedding reignites the ancient feud be...,"{'id': 119050, 'name': 'Grumpy Old Men Collect..."
3,31357,Waiting to Exhale,NaN,False,16000000,en,Waiting to Exhale,"Cheated on, mistreated and stepped on, the wom...",NaN
4,11862,Father of the Bride Part II,NaN,False,0,en,Father of the Bride Part II,Just when George Banks has recovered from his ...,"{'id': 96871, 'name': 'Father of the Bride Col..."
...,...,...,...,...,...,...,...,...,...
45461,439050,Subdue,http://www.imdb.com/title/tt6209470/,False,0,fa,رگ خواب,Rising and falling between a man and woman.,NaN
45462,111109,Century of Birthing,NaN,False,0,tl,Siglo ng Pagluluwal,An artist struggles to finish his work while a...,NaN
45463,67758,Betrayal,NaN,False,0,en,Betrayal,"When one of her hits goes wrong, a professiona...",NaN
45464,227506,Satan Triumphant,NaN,False,0,en,Satana likuyushchiy,"In a small town live two brothers, one a minis...",NaN
45465,461257,Queerama,NaN,False,0,en,Queerama,50 years after decriminalisation of homosexual...,NaN

In [90]:
#filmes
#coletaneasDf
#atoresDf
#atuacoesDf
#produtoresDf
#producoesDf
#avaliacoesDf
#keyWordsDf
#generosDf
#genero_filmeDf

In [ ]:
### TODO: Corrigir a coluna id_coletanea em filmes